{
  "base_model_name_or_path": "EleutherAI/polyglot-ko-12.8b",
  "bias": "none",
  "enable_lora": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "lora_alpha": 32.0,
  "lora_dropout": 0.05,
  "merge_weights": false,
  "modules_to_save": [
    "embed_in",
    "embed_out"
  ],
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "query_key_value",
    "dense",
    "dense_h_to_4h",
    "dense_4h_to_h"
  ],
  "task_type": "CAUSAL_LM"
}